<script lang="ts">
import {Prop, BaseComponent, VST} from '../../../../core'

@VST export default class FilesCompact extends BaseComponent {

}
// Тут компактный компонент файлов, которые загружаются по кнопке, если несколько файлов, то создаётся архив.
//
// 3 кнопки, скачать, добавить, просмотреть фвйл/архив.
//
//   При открытии архива в нём можно создавать папки и загружать файлы,
//   возможно методом drop с подтвержденитем,
//   что файл будет заменён, если есть с таким названием
//
// Что бы компонент легко подключался и мог использоваться хоть напрямую как поле, хоть как отдельный компонент в других полях

</script>
